     A          R RRPGWEBP         
     A            KEY          750A
     A            RECID          1A
     A            REQUEST    32000A
     A          K KEY              